ci4/app/Controllers/Home.php

SELECT `user`.`id` as `id`
FROM `users` `user`
WHERE `user`.`username` = 'xhris'
AND `user`.`password` = '1234'
---
	public function LoginUsers($username,$password){

		$db = \Config\Database::connect();

			$builder = $db->table('users user');

			$query   = $builder->select('user.id as id')

						->where('user.username', $username)

						->where('user.password', $password);

			return $query->get()->getResult();

SELECT `user`.`id` as `id`, `user`.`email` as `email`, `user`.`rol_id` as `rol_id`
FROM `users` `user`
WHERE `user`.`username` = 'admin'
AND `user`.`password` = '1234'
---
	public function loginsUsers ($username, $password){
        $db = \Config\Database::connect();
        $request = \Config\Services::request();
        $username = $request->getPostGet('username');
        $password = $request->getPostGet('password');

        $builder = $db->table('users user');

        $query = $builder->select('user.id as id, user.email as email, user.rol_id as rol_id')

                    ->where('user.username', $username)

                    ->where('user.password', $password);

        return $query->get()->getResult();

DELETE FROM `users`
WHERE `id` = '27'
---
	public function deleteUser($idUser) {
        $db      = \Config\Database::connect();
        $builder = $db->table('users');
        $builder->delete(['id' => $idUser]);