ci4/app/Controllers/Micontrolador.php

INSERT INTO `users` (`name`, `email`, `password`, `username`, `rol_id`) VALUES ('admin2.0', 'admin2.0@gmail.com', '1234', 'admin2.0', 2)
SELECT *
FROM `users`
 LIMIT 10
SELECT *
FROM `users`
---
	public function guarda()
	{
		$db = \Config\Database::connect();
		$userModel = new UserModel($db);
		$request = \Config\Services::request();
		$data = array(

			'name' => $request->getPostGet('name'),
			'email' => $request->getPostGet('email'),
			'password' => $request->getPostGet('password'),
			'username'=>$request->getPostGet('username'),
			'rol_id' => 2,
		);
		$id = 0;
		if ($request->getPostGet('id')) {
			$id = $request->getPostGet('id');
		}
		if ($userModel->save($data) === false) {
			var_dump($userModel->errors());
		}
		if ($request->getPostGet('id')) {
			$users = $userModel->findAll();
			$users = array('users' => $users);
			$estructura = view('estructura/header') . view('estructura/body', $users);

		} else {
			$users = $userModel->findAll();

INSERT INTO `users` (`name`, `email`, `password`, `username`, `rol_id`) VALUES ('admin3', 'admin3@gmail.com', '1234', 'admin3', 1)
SELECT *
FROM `users`
---
	public function AdminSave()
	{
		$db = \Config\Database::connect();
		$userModel = new UserModel($db);
		$request = \Config\Services::request();
		$data = array(

			'name' => $request->getPostGet('name'),
			'email' => $request->getPostGet('email'),
			'password' => $request->getPostGet('password'),
			'username'=>$request->getPostGet('username'),
			'rol_id' => 1,
		);
		$id = 0;
		if ($request->getPostGet('id')) {
			$id = $request->getPostGet('id');
		}
		if ($userModel->save($data) === false) {
			var_dump($userModel->errors());
		}
		if ($request->getPostGet('id')) {
			$users = $userModel->findAll();
			$users = array('users' => $users);
			$estructura = view('estructura/header') . view('estructura/body', $users);

		} else {
			$users = $userModel->findAll();

SELECT *
FROM `users`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `users`
---
	public function borrar()
	{
		$db = \Config\Database::connect();
		$userDel = new Home();
		$request = \Config\Services::request();
		$id = $request->getPostGet('id');
		$userDel = $userDel->deleteUser($id);
		$userModel = new UserModel($db);
		$users = $userModel->paginate(10);

SELECT *
FROM `users`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `users`
---
	public function index()
	{
		$db = \Config\Database::connect();
		$userModel = new UserModel($db);
		$users = $userModel->paginate(10);