ci4/app/Controllers/Micontrolador.php

SELECT COUNT(*) AS `numrows`
FROM `users`
---
	public function admin()
	{
		$session = \Config\Services::session();
		$db = \Config\Database::connect();
		$userDel = new Home();
		$request = \Config\Services::request();
		$id = $request->getPostGet('id');
		$userModel = new UserModel($db);
		$users = $userModel->paginate(10);