ci4/app/Controllers/Micontrolador.php

SELECT *
FROM `users`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `users`
---
	public function index()
	{
		$db = \Config\Database::connect();
		$userModel = new UserModel($db);
		$users = $userModel->paginate(10);