ci4/app/Controllers/UserAjax.php

        public function index()
        {
            $model = new UserAjaxModel();

            $data['users'] = $model->orderBy('id', 'ASC')->findAll();
---
SELECT *
FROM `users`
ORDER BY `id` ASC